==================
Single Line Comment Before Statement
==================

-- this is a comment
SELECT 1

---

(tsql_file
  (comment)
  (batch
    (sql_clauses
      (dml_clause
        (select_statement_standalone
          (select_statement
            (query_expression
              (query_specification
                (select)
                (select_list
                  (select_list_elem
                    (expression_elem
                      (expression
                        (primitive_expression
                          (primitive_constant
                            (decimal_)))))))))))))))

==================
Single Line Comment After Statement
==================

SELECT 1 -- trailing comment

---

(tsql_file
  (batch
    (sql_clauses
      (dml_clause
        (select_statement_standalone
          (select_statement
            (query_expression
              (query_specification
                (select)
                (select_list
                  (select_list_elem
                    (expression_elem
                      (expression
                        (primitive_expression
                          (primitive_constant
                            (decimal_))))))))))))))
  (comment))

==================
Block Comment Before Statement
==================

/* multi-line
   comment */
SELECT 1

---

(tsql_file
  (comment)
  (batch
    (sql_clauses
      (dml_clause
        (select_statement_standalone
          (select_statement
            (query_expression
              (query_specification
                (select)
                (select_list
                  (select_list_elem
                    (expression_elem
                      (expression
                        (primitive_expression
                          (primitive_constant
                            (decimal_)))))))))))))))

==================
Block Comment Inline
==================

SELECT /* inline */ 1

---

(tsql_file
  (batch
    (sql_clauses
      (dml_clause
        (select_statement_standalone
          (select_statement
            (query_expression
              (query_specification
                (select)
                (comment)
                (select_list
                  (select_list_elem
                    (expression_elem
                      (expression
                        (primitive_expression
                          (primitive_constant
                            (decimal_)))))))))))))))
