=====================================
BEGIN END
=====================================

BEGIN SELECT 1 END

---

(tsql_file
  (batch
    (sql_clauses
      (cfl_statement
        (block_statement
          (sql_clauses
            (dml_clause
              (select_statement_standalone
                (select_statement
                  (query_expression
                    (query_specification
                      (select)
                      (select_list
                        (select_list_elem
                          (expression_elem
                            (expression
                              (primitive_expression
                                (primitive_constant
                                  (decimal_))))))))))))))))))

=====================================
IF ELSE
=====================================

IF 1 = 1 SELECT 1 ELSE SELECT 2

---

(tsql_file
  (batch
    (sql_clauses
      (cfl_statement
        (if_statement
          (search_condition
            (predicate
              (expression
                (primitive_expression
                  (primitive_constant
                    (decimal_))))
              (comparison_operator)
              (expression
                (primitive_expression
                  (primitive_constant
                    (decimal_))))))
          (sql_clauses
            (dml_clause
              (select_statement_standalone
                (select_statement
                  (query_expression
                    (query_specification
                      (select)
                      (select_list
                        (select_list_elem
                          (expression_elem
                            (expression
                              (primitive_expression
                                (primitive_constant
                                  (decimal_)))))))))))))
          (sql_clauses
            (dml_clause
              (select_statement_standalone
                (select_statement
                  (query_expression
                    (query_specification
                      (select)
                      (select_list
                        (select_list_elem
                          (expression_elem
                            (expression
                              (primitive_expression
                                (primitive_constant
                                  (decimal_))))))))))))))))))

=====================================
WHILE
=====================================

WHILE 1 = 1 SELECT 1

---

(tsql_file
  (batch
    (sql_clauses
      (cfl_statement
        (while_statement
          (search_condition
            (predicate
              (expression
                (primitive_expression
                  (primitive_constant
                    (decimal_))))
              (comparison_operator)
              (expression
                (primitive_expression
                  (primitive_constant
                    (decimal_))))))
          (sql_clauses
            (dml_clause
              (select_statement_standalone
                (select_statement
                  (query_expression
                    (query_specification
                      (select)
                      (select_list
                        (select_list_elem
                          (expression_elem
                            (expression
                              (primitive_expression
                                (primitive_constant
                                  (decimal_))))))))))))))))))

=====================================
TRY CATCH
=====================================

BEGIN TRY SELECT 1 END TRY BEGIN CATCH SELECT 2 END CATCH

---

(tsql_file
  (batch
    (sql_clauses
      (cfl_statement
        (try_catch_statement
          (sql_clauses
            (dml_clause
              (select_statement_standalone
                (select_statement
                  (query_expression
                    (query_specification
                      (select)
                      (select_list
                        (select_list_elem
                          (expression_elem
                            (expression
                              (primitive_expression
                                (primitive_constant
                                  (decimal_)))))))))))))
          (sql_clauses
            (dml_clause
              (select_statement_standalone
                (select_statement
                  (query_expression
                    (query_specification
                      (select)
                      (select_list
                        (select_list_elem
                          (expression_elem
                            (expression
                              (primitive_expression
                                (primitive_constant
                                  (decimal_))))))))))))))))))

=====================================
RETURN
=====================================

RETURN 0

---

(tsql_file
  (batch
    (sql_clauses
      (cfl_statement
        (return_statement
          (expression
            (primitive_expression
              (primitive_constant
                (decimal_)))))))))

=====================================
PRINT
=====================================

PRINT 'hello'

---

(tsql_file
  (batch
    (sql_clauses
      (cfl_statement
        (print_statement
          (expression
            (primitive_expression
              (primitive_constant
                (string_lit)))))))))

=====================================
THROW
=====================================

THROW 50000, 'Error message', 1

---

(tsql_file
  (batch
    (sql_clauses
      (cfl_statement
        (throw_statement
          (expression
            (primitive_expression
              (primitive_constant
                (decimal_))))
          (expression
            (primitive_expression
              (primitive_constant
                (string_lit))))
          (expression
            (primitive_expression
              (primitive_constant
                (decimal_)))))))))
